InformationRegisters/ПрожиточныеМинимумы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ПрожиточныеМинимумы</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СоциальнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СоциальныеГруппыНаселения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СоциальныеГруппыНаселения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СоциальныеГруппыНаселения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДетиДо6</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДетиДо18</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Трудоспособные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеТрудоспособные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ПрожиточныеМинимумы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ДанныеПрожиточногоМинимумаТрудоспособные(ДатаАктуальности = Неопределено) Экспорт
	
	ДанныеПМ = Новый Структура("Размер, Период");
	
	СрезПоследних = РегистрыСведений.ПрожиточныеМинимумы.СрезПоследних(ДатаАктуальности, Новый Структура("СоциальнаяГруппа",Перечисления.СоциальныеГруппыНаселения.Трудоспособные));
	Если СрезПоследних.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru='Сведения о прожиточном минимуме не заполнены';uk='Відомості про прожитковий мінімум не заповнено'");
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДанныеПМ, СрезПоследних[0]);
	
	Возврат ДанныеПМ;
	
КонецФункции

#КонецОбласти

#КонецЕсли
